### Terraform Plan 📦
  ```hcl
  [command]/home/runner/work/_temp/954ba911-3586-4fc4-8246-ddf754d698d6/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.hetzner_server.data.local_file.snapshot_ids will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "local_file" "snapshot_ids" {
      + content              = (known after apply)
      + content_base64       = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + filename             = ".terraform/modules/hetzner_server/modules/hetzner/server/tmp/snapshots.json"
      + id                   = (known after apply)
    }

  # module.hetzner_server.hcloud_server.server[0] will be created
  + resource "hcloud_server" "server" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = (known after apply)
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + location                   = "nbg1"
      + name                       = "MyK3s"
      + primary_disk_size          = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cx22"
      + shutdown_before_deletion   = false
      + ssh_keys                   = []
      + status                     = (known after apply)

      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = false
          + ipv6         = (known after apply)
          + ipv6_enabled = true
        }
    }

  # module.hetzner_server.null_resource.get_snapshots will be created
  + resource "null_resource" "get_snapshots" {
      + id       = (known after apply)
      + triggers = {
          + "node_names" = "MyK3s"
        }
    }

  # module.hetzner_server.null_resource.snapshot_before_destroy[0] will be created
  + resource "null_resource" "snapshot_before_destroy" {
      + id       = (known after apply)
      + triggers = {
          + "server_id"   = (known after apply)
          + "server_name" = "MyK3s"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.hetzner_server.data.local_file.snapshot_ids will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "local_file" "snapshot_ids" {%0A      + content              = (known after apply)%0A      + content_base64       = (known after apply)%0A      + content_base64sha256 = (known after apply)%0A      + content_base64sha512 = (known after apply)%0A      + content_md5          = (known after apply)%0A      + content_sha1         = (known after apply)%0A      + content_sha256       = (known after apply)%0A      + content_sha512       = (known after apply)%0A      + filename             = ".terraform/modules/hetzner_server/modules/hetzner/server/tmp/snapshots.json"%0A      + id                   = (known after apply)%0A    }%0A%0A  # module.hetzner_server.hcloud_server.server[0] will be created%0A  + resource "hcloud_server" "server" {%0A      + allow_deprecated_images    = false%0A      + backup_window              = (known after apply)%0A      + backups                    = false%0A      + datacenter                 = (known after apply)%0A      + delete_protection          = false%0A      + firewall_ids               = (known after apply)%0A      + id                         = (known after apply)%0A      + ignore_remote_firewall_ids = false%0A      + image                      = (known after apply)%0A      + ipv4_address               = (known after apply)%0A      + ipv6_address               = (known after apply)%0A      + ipv6_network               = (known after apply)%0A      + keep_disk                  = false%0A      + location                   = "nbg1"%0A      + name                       = "MyK3s"%0A      + primary_disk_size          = (known after apply)%0A      + rebuild_protection         = false%0A      + server_type                = "cx22"%0A      + shutdown_before_deletion   = false%0A      + ssh_keys                   = []%0A      + status                     = (known after apply)%0A%0A      + public_net {%0A          + ipv4         = (known after apply)%0A          + ipv4_enabled = false%0A          + ipv6         = (known after apply)%0A          + ipv6_enabled = true%0A        }%0A    }%0A%0A  # module.hetzner_server.null_resource.get_snapshots will be created%0A  + resource "null_resource" "get_snapshots" {%0A      + id       = (known after apply)%0A      + triggers = {%0A          + "node_names" = "MyK3s"%0A        }%0A    }%0A%0A  # module.hetzner_server.null_resource.snapshot_before_destroy[0] will be created%0A  + resource "null_resource" "snapshot_before_destroy" {%0A      + id       = (known after apply)%0A      + triggers = {%0A          + "server_id"   = (known after apply)%0A          + "server_name" = "MyK3s"%0A        }%0A    }%0A%0APlan: 3 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
  ```
  